/*******************************************
 * Автор:    Арестова Е.Е.                 *
 * Дата:     24.09.2024                    *
 * Название: Циклы с пред- и постусловием  *
 * Вариант:  2                             *
 *******************************************/

#include <iostream>
using namespace std;

int main() {
	setlocale(LC_ALL, "RU");

	double m0 = 1.675;
	double c = 298792;
	double v[]{50000, 100000, 150000, 200000, 250000, 260000, 270000, 280000, 290000};

	for (size_t i = 0; i < size(v); i++) {

		cout << "Значение v = " << v[i] << ", " << "m = " << m0 * (1.00 / sqrt(1.00 - pow(v[i] / c, 2))) << "; " << endl;
	}
}